[
    "L., 1958.  On some new species of Naididae from Nanking including remarks of certain known species. Acta Hydrobiologica Sinica, 1958: 14-58.",
    "L., 1962. On some naids and tubificids from north-eastern China. Acta Hydrobiologica Sinica, (2): 14-26.",
    "L., 1963. Studies on the aquatic Oligochaeta of China .descriptions of new naids and branchiobdellids. Acta Zoological Sinica, 15(4): 560-570.",
    "L., 1964. Studies on the aquatic Oligochaeta of China .On some species of Naididae from Sinkiang with description of a new species, _Allodero prosetosa_. Acta Zoological Sinica, 16(4):643-652.",
    "L. & K.  H. Chang, 1964. The innate capacity for natural increase of _Daphnia Carinata_ King. Acta Hydrobiologica Sinica, 5(1): 31-36.",
    "Y.,  Liang , Y. L., Sung  K. P. & Wang, S. T., 1975.  On ecological distributions and population densities of mollusca in Lake Tung-Hu, Wuchang. Acta  Hydrobiologica Sinica, 5(3): 371-379.",
    "Experiment on increasing fishery production of Lake Tung-Hu, Wuchang, and an analysis of the underlying principle. Acta Hydrobiologica Sinica, 6(1): 5-15.",
    "L.,  1979. Studies on the aquatic Oligochaeta of China. .Aquatic Oligochaeta of the Huama Lake. Oceanologiaet Limnologia Sinica. 10(3):273-281.",
    "L., H.  C.  Fang & T. N.  Chang, 1979.  A new genus and species of Enchytraeidae from Tibet. Acta Zootaxonomica Sinica, 4(4):312-315.",
    "Y., Y. L.Liang  &  T. H.  Wu, 1980.  Studies on community structure and dynamics of zoobenthos in Lake Dong Hu, Wuhan. Acta Hydrobiologica Sinica, 7(1):41-56.",
    "& Y. L. Liang, 1981.  An estimation of the potential productivity and stocking rate of fingerlings of Silver and Bighead carps in Donghu by manes of Phytoplankton production. Journal of Fisheries of China, 5(4):343-350.",
    "L., J. M. Melack & J. Wang, 1981.  Primary production and fish yields in Chinese ponds and lakes.  Transactions of the American Fisheries Society,  110:346-350.",
    "M., Y. L. Liang & P. H. Lenz, 1981. Ecological responses of the plankton of Mono Lake to increased salinity. UCSB Mono Lake Symposium.",
    "Y., Liang Y. L., Wu T. H., 1982.  Physical and chemical characteristics of tow highly productive small lakes in the suburbs of Wuhan Shi with referrance to the analysis of their biological phase. Journal of Fisheries of China, 6(4):331-343.",
    "Y., C. X. Xie, Y. L. Liang &  S. D.Wang, 1982.  Preliminary study on population densities and seasonal fluctuation of zoobenthos In Wangtian Lake, Hubei Province. Oceanologiaet Limnologia Sinica, 13(1):78-86.",
    "H., Y. L. Liang  & G. Q. Deng, 1984.  Toxicity of Mercuric Chloride to Daphnia Magna Straus, with special emphasis on long-term tests. Acta Hydrobiologica Sinica, 8(4): 449-456.",
    "H., Y. L. Liang  & M. J. Sun, 1984.  Ecological effects of BHC on Daphnia Magna Straus. Acta Hydrobiologica Sinica, 8(3): 259-269.",
    "L., 1984. Annual production of _Branchiura sowerbyi_ (Oligochaeta, Tubificidae) in the Donghu Lake, Wuhan, China.  Chinese Journal of Oceanology and Limnology, 2(1): 102-108.",
    "H.& Y. L.Liang, 1986.  Growth, reproduction and population growth form of _Daphnia magna_ Straus. Acta Hydrobiologica Sinica, 10(1): 24-31.",
    "L., 1987. Preliminary study of the aquatic Oligochaeta of the Changjiang (Yangtze) River. Hydrobiologia, 155: 195-198.",
    "L., J. Wang & C. L. Hu, 1988. Hydrobiology of a flooding ecosystem, Lake Chenhu in Hanyang, Hubei, with preliminary estimation of its potential fishery production capacity.  Chinese Journal of Oceanology and Limnology, **** l6 (1): 1-14.",
    "O., S. Qi & Y. L. Liang, 1990.  The aquatic Oligochaeta from the People's Republic of China. Canadian Journal of Zoology, 68: 901-916.",
    ", D. Y. Sun, Y. L. Liang & B. Sun, 1990. Marine Oligochaeta of Jiaozhou Bay, Yellow Sea coast of China. Hydrobiologia, 202: 107-124.",
    "L., J. Wang  & C. L. Hu, 1991. Hydrobiology of a flooding ecosystem, Chenhu  Lake in Hanyang, Hubei, with preliminary estimation of its potential fishery production capacity.  In Z. Z. Ruan  (ed), The Proceeding of Resource, Ecology, Environment and Economy in Yangtze Basin.  Science Press, Beijing: 388-397.",
    "& Y. L. Liang, 1991.  Seasonal dynamics of  planktonic algae in the middle reach (Wuhan section) of the Changjiang River. In Z. Z. Ruan (ed), The Proceeding of Resource, Ecology, Environment and Economy in Yangtze Basin.  Science Press, Beijing: 196-203.",
    "& Y. L.  Liang, 1991. Ecological characteristics of planktonic algae in Gezhouba Reservior. **** In Z. Z. Ruan   (ed), The Proceeding of Resource, Ecology, Environment and Economy in Yangtze Basin.  Science Press, Beijing: 211-217.",
    "H., R. Q.  Liu, D. F.  Li, L. Y. Ni,  Z. T.  Wu & Y. L.  Liang, 1992.  Comprehensive evaluation of trophic states of water systems in Fengqiu experimental area of Huang-Huai-Hai Plain. Journal of Lake Sciences, 4(2):46-51.",
    "F., R. Q. Liu, L.Y. Ni,  Z. T.  Wu, Q. H.  Cai & Y. L.  Liang,  1992.  Physicochemical characteristics and multivariate analysis of waters In Fengqiu Experimental District In The Huang-Huai-Hai Plain, Henna Province. Acta Hydrobiologica Sinica, 16(3):251-259.",
    "L., Q. H. Cai,  J.  Wang & Z. S.  Li,  1994.  Comprehensive environmental analyses and similarity of fresh water ecosystems around the Chinese Zhongshan Station, Antarctica. Acta Hydrobiologica Sinica, 18(1): 92-94.",
    "H.& Y. L.Liang, 1995.  Basic characters of wetlands in The Huanghuaihai Plain. Chen, Y. Y. (ed)Study of Wetlands in China, Jilin Sciences and Technology Press, Jilin: 299-305 **.**",
    "H., Z. T. Wu,  D. F.  Li & Y. L.  Liang,  1995.  Preliminary report on in situ experiment of zooplankton in Caogang Lake, Henan Province. Acta Hydrobiologica Sinica, 19(2): 190-192.",
    "F., Q. H. Cai  & Y. L. Liang, 1995. Food preference of grass carp for some aquatic macrophytes. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing: 219-226.",
    "L.,  Q. H. Cai  & D. F. Li, 1995. Mathematical analyses of relationship between grass carp and aquatic macrophytes of Baoan Lake, Hubei.  In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing:  213-218.",
    "L., Q. H. Cai  & Z. G. Su, 1995. Dynamics of aquatic macrophytes and their relationship with some environmental factors of Baoan Lake, Hubei. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing: 172-177.",
    "L. & H. Q. Liu, Resources, environment and fishery ecological management of macrophytic lakes, 1995. Science Press, Beijing: 1-335.",
    "L., T. H. Wu  & Z. C. Xie, 1995. On The current conditions of zoobenthos in Baoan Lake with an assessment of its potential fishery production capacity. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing: 178-193.",
    "L., T. H. Wu  &  Z. C. Xie, 1995. A preliminary investigation of zoobenthos and its potential fishery production capacity in Xiliang Lake. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing: 194-204.",
    "Y., Q. H. Cai, D. F. Li, R. Q. Liu, Z. T. Wu & Y. L. Liang, 1995.  Aquatic vegetation in the Fengqiu experimental area of the Huanghuaihai Plain. Journal of Lake Sciences, 7(4): 357-364.",
    "& Y. L. Liang, 1995.  The annual dynamics of density, biomass and production of phytoplankton of Baoan Lake with estimation of potential fishery production capacity of this resource. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes, Science Press, Beijing: 61-88.",
    "& Y. L. Liang, 1995.  A preliminary study on the structure and abundance of the attached algae in Baoan Lake. In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing: 109-119.",
    "& Y. L.  Liang, 1995.  The seasonal variations of standing crop and production of planktonic algae and the estimation of potential fishery capacity of Xiliang lake.  In: Y. L. Liang & H. Q. Liu (eds), Resources, Environment and Fishery Ecological Management of Macrophytic Lakes,  Science Press, Beijing:  89-108.",
    "H., H. Z. Wang & Y. L.  Liang, 1996.  Stepwise discriminant analysis for the ecological characters of 18 lakes around the Chinese Zhongshan Station and Great Wall Station, Antarctica. Acta Hydrobiologica Sinica, 20(1): 83-85.",
    "C., Y. L. Liang & T. H. Wu,  1996.  Diversity of zoobenthos in lakes in the medium reaches of Changjiang River. Acta Hydrobiologica Sinica, 20 (supplement): 103-113.",
    "H., J. Wang, Z. S. Li, W. S. Feng, H. Z. Wang & Y. L. Liang,  1997.  Evaluation of environmental quality of some lakes around Chinese Zhongshan Station and Great Wall Station, Antactic, based on trophic state index. Oceanologia et Limnologia Sinica, 28(Supplement): 134-138.",
    "S., J. Wang, Z. H. Lei, X. M.  Liang, X. D.  Chen & Y. L.  Liang, 1997.  Hydrochemical properties of Lakes In Larsemann Hill, Antarctic. Chinese Journal of Polar Research, 9(1):71-77.",
    "S., J. Wang , H. Z. Wang, X. M.  Liang, W. S. Feng, Z. H.  Lei, X. D. Chen  & Y. L. Liang, 1997.  A comparative study on hydrochemical properties of lakes on Filds Peninsula, west Antarctic and on Larsemann Hills, East Antarctic. Chinese Journal of Polar Research, 9(3): 176-181.",
    "L.& Z. C. Xie, 1997.  Aquatic Oligochaeta from Wuling Mountains area. D. X. Song (ed.), invertebrate of Wuling Mountains Area, Southwestern China. Science Press, Beijing: 383-394.",
    "Z. & Y. L. Liang, 1997.  Two new species of Oligochaeta (Annelida) from King George Island, Antarctica. Oceanologia et Limnologia Sinica,28 (supplement): 177-184.",
    "& Y. L. Liang, 1997.  Ecological characteristics of planktonic algae in Mochou Lake near Zhongshan Station in the Antarctica. Oceanologia et Limnologia Sinica, 28 (supplement): 163-170.",
    ", Y. L. Liang & Z. S.  Li, 1997.  The composition and distribution of algae in different waters in the Larsemann Hills Area, Antarctica. Oceanologia et Limnologia Sinica,28 (supplement):139-147.",
    ", Y. L. Liang  & Z. S. Li, 1997.  Studies on density and biomass of planktonic algae in different waters in the area near Zhongshan Station, Antarctica. Oceanologia et Limnologia Sinica, 28 (Supplement): 155-162.",
    ", Y. L. Liang, H. Z.  Wang & W. S.  Feng,  1997.  The chlorophyll a content and primary production of planktonic algae in freshwaters of Fildes Peninsula, Antarctica. Oceanologia et Limnologia Sinica, 28 (supplement): 148-154.",
    "H., Y. L. Liang & X. D. Sun, 1997.  Newly recorded species of free-living nematodes from China (Chromadorida, Enoplida & Araeolaimida). Acta Hydrobiologica Sinica, 21(4): 312-321.",
    "Z. & Y. L. Liang, 1997.  Analyses of distribution and faunal relationship of inland-water microdrile Oligochaeta (Annelida) in the world and China. Acta Hydrobiologica Sinica, 21 (supplement): 93-102.",
    "H. & Y. L. Liang, 1997.  Preliminary study on free-living nematodes of Changjiang River Basins of China. Acta Hydrobiologica Sinica, 21 (supplement): 114-122.",
    "H., D. F. Li, Z. T, Wu, R. Q. Liu, L. Y. Ni & Y. L. Liang, 1998.  Study on Structural Characteristics and Material energy Dynamics of Aquatic Ecosystems in Huang-Huai-Hai Plain. In: J. P. Fu & F. A. Xu (eds), Agricultural Ecosystem on the Northern Henan Plain, China Meteorological Press, Beijing: 170-178.",
    "F., Q. H. Cai & Y. L. Liang, 1998.  Fish Fauna and Fishery Evaluation of Fengqiu Experimental Area of Huang-Huai-Hai Plain. In: J. P. Fu & F. A. Xu (eds), Agricultural Ecosystem on the Northern Henan Plain, China Meteorological Press, Beijing: 186-190.",
    "S., X. D. Chen, Y. H. Zhang, X. M. Liang, J. Wang,  & Y. L.  Liang, 1998. On the organic compounds in water of Mochou and Heart Lake in Lars Emann Hills, Antarctica. Chinese Journal of Polar Research, 10(2): 83-93.",
    "L. & H. Z. Wang, 1998. Microdrile oligochaetes (Annelida: Oligochaeta). In: W. Y. Yin (eds.), Pictorial Keys to Soil Animals of China. Science Press, Beijing: 90-98, 476-480.",
    "L., H. Z. Wang & Z. C.  Xie, 1998.  Studies on the aquatic Oligochaeta of China . Diagnoses of new records and rare species of Naididae and Tubificidae. Acta Hydrobiologica Sinica, 22(1): 54-61.",
    "Z. & Y. L. Liang, 1998. A review of Chinese microdrile oligochaetological study. In: D. S. Niu (ed.), Systematics in China: Retrospect and Prospect. Chinese Forestry Publishing House, Beijing: 49-57.",
    "P., H. Z. Wang  & Y. L. Liang, 1998.  Classification and characters of freshwater Unionacea (Bivalvia). In: D. S. Niu (ed.), Systematics in China: Retrospect and Prospect. Beijing: Chinese Forestry Publishing House, pp.69-72.",
    "T., Q. H. Cai, D. F. Li & Y. L. Liang, 1998.  Fauna and ecological characteristics of rotifer in Fengqiu experiment area, Huang-Huai-Hai Plain. In: J. P. Fu & F. A. Xu (eds), Agricultural Ecosystem on the Northern Henan Plain, China Meteorological Press, Beijing: 209-217.",
    "C., Q. H. Cai, D. F. Li & Y. L. Liang, 1998.  Preliminary Study on zoobenthos and its potential fishery production capability of some waters in Huang-Huai-Hai Plain. In: J. P. Fu & F. A. Xu (eds), Agricultural Ecosystem on the Northern Henan Plain, China Meteorological Press, Beijing: 191-198.",
    "S., X. D. Chen, Y. H. Zhang, X. M. Liang, J. Wang & Y. L. Liang, 1998.  On the organic compounds in water of Mochou Lake and Heart Lake in Larsemann Hills, Antarctoca. Joural of Glaciology and Geocryology, 20(4): 388-397.",
    "L.,1999. Ten years' endeavors on biological facet of _Journal of Lake Sciences_ : retrospect and prospect. Journal of Lake Sciences, 11(2): 97-98.",
    "L. & H. Z. Wang, 1999. Chapter 3. Community ecology. In: J. K. Liu (ed.), Advanced Hydrobiology.  Science Press,  Beijing: 77-99.",
    "L. & H. Z. Wang, 1999. Chapter 10. Zoobenthos. In: J. K. Liu (ed.), Advanced Hydrobiology. Science Press, Beijing: 241-259.",
    "P., Y. L. Liang, S. Ouyang, H. Z. Wang  & T. H. Wu, 1999.  On population ecology of _Sphaerium lacustre_ (M ller) of Donghu Lake, Wuhan, China. In: China Zoological Society (ed.), Zoological Studies in China.  Chinese Forestry Publishing House, Beijing: 334-339.",
    "P., Y. L. Liang & H. Z. Wang, 1999.A comparative study on glochidial morphology of Unionidae(Bivalvia). Acta Hydrobiologica Sinica, 23(2): 141-145.",
    "P., S. OuYang, Y. L. Liang & Y. F. Yu, 1999.  A scanning electron microscopic study of the shells of Unionidae. Journal of Nanchang University (Natural Sciences), 23(1): 58-61.",
    "J. & Y. L. Liang, 1999. A study of dry-to-wet weight ratio of aquatic macroinvertebrates. Journal of Huazhong University of Sciences & Technology, 27(9): 61-63.",
    "J., Y. L. Liang & H. Z. Wang, 1999.  Production of gastropods in Lake Biandantang  . annual production of _Bellamya aeruginosa_. Acta Hydrobiologica Sinica, 23(4): 346-351.",
    "Z., Z. C. Xie, X. P. Wu & Y. L. Liang, 1999.  A preliminary study of zoobenthos in the Poyang Lake, the largest freshwater lake of China, and its adjoining reaches of Changjiang River. Acta Hydrobiologica Sinica, 23 (supplment): 132-138.",
    ", Y. L. Liang, & Z. C. Xie, 1999.  Comparative studies on Chlorophyll _a_ content and production of planktonic algae in a large river-connected lake (the Poyang Lake) and neighboring sections of the Changjiang River. Acta Hydrobiologica Sinica, 23(supplment): 40-46.",
    "Z., Z. C. Xie & Y. L. Liang, 1999.  Records of Enchytraeidae (Clitellata) from the People's Republic of China. Hydrobiologia, 406: 57-66.",
    "Z., Z. C. Xie, X. P. Wu & Y. L. Liang, 1999.  A preliminary study of zoobenthos in the Poyang Lake, the largest freshwater lake of China, and its adjoining reaches of Changjiang River. Acta Hydrobiologica Sinica, 23 (supplement): 132-138.",
    "H. & Y. L. Liang.  1999. A comparative study of benthic nematodes in two Chinese lakes with contrasting sources of primary production. Hydrobiologia, 411: 31-37.",
    "H. & Y. L. Liang.  1999. Two new species of Actinolaimidae Thorne, 1939 (Nematoda: Dorylaimida) from China. Journal of Nematology, 31(4): 475-481.",
    "P., Y. L. Liang, H. Z. Wang & S. Ouyang, 1999.  Morphological characters of glochidia of Unionidae and the taxonomic significance. Acta Hydrobiologica Sinica, 23 (supplement): 139-147.",
    "C., H. Z. Wang & Y. L. Liang, 1999.  Studies on the Enchytraeidae (Oligochaeta, Annelida) of China. I. On new species and new records of the genus _Hemienchytraeus_. Acta Hydrobiologica Sinica, 23(4): 352-358.",
    "C., Y. L. Liang & H. Z. Wang, 1999.  Taxonomic study on _Fridericia_ (Enchytraeidae, Oligochaeta) along the Changjiang (Yangtze) Basin. Acta Hydrobiologica Sinica, 23 (supplement): 158-163.",
    "C., Y. L. Liang, J. Wang, H. Z. Wang, R. Q. Liu & W. S. Feng, 1999.  Preliminary Studies of macroinvertebrates of the mainstream of the Changjiang (Yangtze) River. Acta Hydrobiologica Sinica, 23(supplment): 148-157.",
    "J., Y. L. Liang & H. Z. Wang, 1999.  Annual production of five species of Chironomidae (Diptera) in Houhu Lake, a typical algal lake (Wuhan, China).  Chinese Journal of Oceanology and Limnology, 17(2): 112-118.",
    "J., Y. L. Liang & H. Z. Wang, 1999.  Energy flow of _Bellamya aeruginosa_ in a shallow macrophyte-dominated lake, Lake Biandantang. Acta Hydrobiologica Sinica, 23(supplment): 115-121.",
    "P., Y. L. Liang  & H. Z. Wang, 2000.  A comparative study on glochidial morphology of Unionidae (Bivalvia). Acta Hydrobiologica Sinica, 24(3): 252-256.",
    "P., Y. L. Liang, H. Z. Wang, Z. C. Xie & S.  OuYang, 2000.  Distribution and species diversity of freshwater mollusca of lakes along mid-lower reaches of the Yangtze River. Journal of Lake Sciences, 12(2): 111-118.",
    "P., S. Ou-Yang, Y. L. Liang, H. Z. Wang & Y. F. Yu, 2000. Comparative studies on shell and radular morphology of _Bellamya_ (Gastropoda: Viviparidae). Journal of Nanchang University (Natural Sciences), 24(1): 1-5.",
    "Z., Z. C. Xie & Y. L. Liang, 2000.  Seasonal dynamics and vertical distribution of enchytraeid guild __ in Luojianshan, Wuhan, China. In: W. Y. Yin, et al. (eds.), Soil Animals of China. Science Press, Beijing: 182-191.",
    "C., Y. L. Liang & H. Z. Wang, 2000.  A new species of _Marionina_ (Oligochaeta: Annelida: Enchytraeidae) Acta Zootaxonomica Sinica, 25(2): 143-146.",
    "C.,  J.  Wang & Y. L. Liang, 2000.  Composition and faunal similarity of aquatic oligochaetes in different waters in the Changjiang River Basin. Acta Hydrobiologica Sinica, 24(5):  451-457.",
    "J., Y. L. Liang  & H. Z. Wang, 2000.  Annual production of _Bellamya aeruginosa_ in Houhu Lake, Wuhan. Journal of Lake Sciences, 12(1) :  68-72.",
    "L. & H. Z. Wang, 2000.  Annelida, Oligochaeta, Microdrile oligochaetes.  In: W. Y. Yin, et al. (ed), Pictorial Keys to Soil Animals of China. Scinece Press, Beijing, 90-98, 473-478.",
    "Z., Z. C. Xie  & Y. L. Liang, 2000.  A new terrestrial species of _Bothrioneurum_ (Oligochaeta, Tubificidae) from Hunan Province, China. Species Diversity, 5 (1): 7-12.",
    "H. & Y. L. Liang, 2000.  A new species of Odontolaimus de Man (Nematoda: Odontoliamidae) from Anhui Province, China. Journal of Nematode Morphology and Systematics, 2 (2):109-112.",
    "H. & Y. L. Liang, 2000.  Inland free-living nematodes in China: a historical review of taxonomic studies with descriptions of _Aphanonchus orientalis_ sp. nov. (Chromadorida: Leptolaimidae) and _Daptonema limnobia_ sp. nov. (Monhysterida: Xyalidae).  Annales Zoologici, 50(2):307-319.",
    "H., P. J. Somerfield, M. Austen  & Y. L. Liang, 2000.  The freeliving nematode genus _Parodontophora_ Timm, 1963 (Nematoda: Monhysterida) is not exclusively marine: _Parodontophora limnophila_ sp. n. from freshwater in China. Hydrobiologia, 431: 205-210.",
    "C., Y. L. Liang & H. Z. Wang, 2000.  Two new species of _Fridericia_ (Enchytraeidae, Oligochaeta) from Changbaishan Mountain, Jilin Province, China. Species Diversity, 5:53-58.",
    "C., Y. L. Liang and H. Z. Wang, 2000. A taxonomic study of _Bryodrilus_ (Enchytraeidae, Oligochaeta) from Changbaishan Mountain, China. Species Diversity, 5: 93-101.",
    "C., Y. L. Liang & H. Z. Wang, 2000. _ Enchytraeus chaoyangensis_, a new terrestrial culture species (Enchytraeidae, Oligochaeta) from northeastern China. Acta Hydrobiologica Sinica, 42 (1/2):69-72.",
    "J., Y. L. Liang  & H. Z. Wang, 2001.  Production of gastropods In Lake Biandantang  . Annual production of _Parafossarulus striatulus_. Acta Hydrobiologica Sinica , 25(1): 36-41.",
    "Z. & Y. L. Liang, 2001.  A preliminary study of oligochaetes in Poyang Lake, the largest freshwater lake of China, and its vacuity, with description of a new species of _Limnodrilus._ Hydrobiologia, 463: 29-38.",
    "H., P. De Ley & Y. L. Liang, 2001.  Description of a new species of the genus _Tylopharynx_ (Nematoda: Diplogasteroidea), _T. clarimphida_ sp. n., with a redescription of _T. foetida_ (Btschli, 1874) Goffort, 1930. Journal of Nematology, 33(2):83-90.",
    "C., Y. L. Liang & J. Wang, 2001. _ Fridericia nanningensis_ , a new terrestrial enchytraeid species (Oligochaeta) from southwestern China. Proceeding of the Biological Society of Washington, 114(1): 275-279.",
    "J., Y. L. Liang, & H. Z. Wang, 2001.  Energy flow of _Bellamya aeruginosa_ in a shallow algal lake, Houhu Lake, Wuhan, China.  Chinese Journal of Oceanology and Limnology, 19(3):243-248.",
    "J., Y. L.Liang & H. Z. Wang, 2001.  Production of gastropods in Lake Biandantang  . Annual production of _Alocinma longicornis_. Acta Hydrobiologica Sinica , 26(4): 322-326.",
    "Z. & Y. L. Liang, 2002.  Seasonal dynamics and vertical distribution of enchytraeids in Luojiashan, Wuhan, China. Natura Jutlandica _,_ Occasional Papers, 2:17-24.",
    "H., Y. L. Liang, Y. Zhong, C. Zh.  Fu & J. K. Chen, 2002. Advances in phylogenetic studies of Nematoda. Chinese Science Bulletin, 47(1):10-15.",
    "J.& Y. L. Liang, 2003.  Energy flow of macrozoobenthic community in a macrophytic lake, Biandantang Lake. Acta Ecologica Sinica,  23(3):  527-538.",
    "H., C. Z. Fu, Y. L. Liang & J. K. Chen, 2004. Distribution of the meiofaunal community in a eutrophic shallow lake of China. Archiv fur Hydrobiologie, 159(4): 555-575.",
    "Z., Q. Q. Xu, Z. C. Xie &Y. L. Liang, 2005.   Chapter 2. Resource and environmental characters of small and medium lake, zoobenthos. In Cui, Y. B & Li, Z. J. (eds), Fishery Resources and Conservation of Environment in Lakes of the Changjiang River Basin. Science Press, Beijing: 52-89.",
    "Z., Q. Q. Xu, Z. C. Xie &Y. L. Liang,  2005.  Chapter 3. Resource and environmental characters of a large river-joining lake, zoobenthos.  In Y. B. Cui & Z. J. Li (eds), Fishery Resources and Conservation of Environment in Lakes of the Changjiang River Basin, Science Press, Beijing,:  143-155.",
    "Z.,  Y. J. Wang & Y. L. Liang, 2005. Chapter 5. Estimation methods for potential fishery production of main stocked animals in lakes, potential production of omnivorous fish. In Y. B. Cui & Z. J. Li (eds), Fishery Resources and Conservation of Environment in Lakes of the Changjiang River Basin, Science Press, Beijing: 304-307.",
    "Z., Xu, Q. Q., Cui, Y. D. and Liang, Y. L. 2007. Macrozoobenthic community of Poyang Lake, the largest freshwater lake of China, in the Yangtze floodplain. Limnology, 8: 65-71."
]